// 1. Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить,
// до якої четверті години попадає число (в першу, другу, третю или четверту частину години).

let time = +prompt('Введіть змінну time яка рівна числу від 0 до 59:', '0');
    if (time<0 || time>59 ){
        document.write('Завдання 1.Ви ввели не корректні дані...'+ "<br/>");
    }else if (time>=0 && time <15) {
        document.write(`Завдання 1. Число ${time} належить до першої чверті`, "<br/>");
    }else if (time>=15 && time <30) {
        document.write(`Завдання 1. Число ${time}  належить до другої чверті`, "<br/>");
    } else if (time>=30 && time <45) {
        document.write(`Завдання 1. Число ${time} належить до третьої чверті`, "<br/>");
    } else if (time>=45 && time <60) {
        document.write(`Завдання 1. Число ${time} належить до четвертої чверті`, "<br/>");
    }else {
        document.write('Завдання 1. Ви ввели не число!');
    }

// 2.У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число
// (у першу, другу чи третю).

let day = +prompt('Введіть змінну day яка рівна числу від 1 до 31:', '0');
if (day<1 || day>31 ){
    document.write('Завдання 2.Ви ввели не корректні дані...', "<br/>", "<br/>");
}else if (day >= 1 && day <= 10) {
    document.write(`Завдання 2. Число ${day} належить до першої декади`, "<br/>", "<br/>");
} else if (day > 10 && day <= 20) {
    document.write(`Завдання 2. Число ${day} належить до другої декади`, "<br/>", "<br/>");
} else if (day >= 20 && day <= 31) {
    document.write(`Завдання 2. Число ${day} належить до третьої декади`, "<br/>", "<br/>");
} else {
    document.write('Завдання 2. Ви ввели не число!', "<br/>", "<br/>");
}

// 3. У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// Перевірте роботу скрипта при test, що дорівнює true, false.
// Напишіть два варіанти скрипта - з коротким записом(тернаркою)

let test = prompt('Введіть змінну test_true(true або false):', 'false');
let test_result = (test !== 'true') ? 'Вірно ' : 'Неправильно ';
document.write(`Завдання 3 v1. ${test_result}`,  "<br/>", "<br/>");

if (test !== 'true' ){
    document.write('Завдання 3 v2. Вірно', "<br/>", "<br/>");
}else {
    document.write('Завдання 3 v2. Неправильно', "<br/>", "<br/>");

}

// 4. Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
// Перевірте  скрипт при a, що дорівнює 1, 0, -3

let a = +prompt('Введіть змінну a:', '0');
if (a !==0){
    document.write('Завдання 4 . Вірно', "<br/>", "<br/>");
}else {
    document.write('Завдання 4 . Невірно', "<br/>", "<br/>");
}

// 5. Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані
// відображається інфа що заплановано на цей день.

let key = +prompt('Завдання 5. Введіть порядковий номер дня тижня(від 1 до 7 включно):', '0');
if (key <= 0 || key > 7) {
    document.write('Завдання 5. Ви ввели не корректні дані...', "<br/>", "<br/>");
}else if(key>0 && key<=7){
    switch (key) {
        case 1:
            document.write('Завдання 5. День 1 ПН: Не забудь піти на роботу', "<br/>", "<br/>");
            break;
        case 2:
            document.write('Завдання 5. День 2 ВТ: Добре відпочинь, тому що ввечері на практику в OWU', "<br/>", "<br/>");
            break;
        case 3:
            document.write('Завдання 5. День 3 СР: Сходити в зал, щоб трохи розімяти кості', "<br/>", "<br/>");
            break;
        case 4:
            document.write('Завдання 5. День 4 ЧТ: Якщо зробиш всі завдання з JS до 20:00, можеш на практику не їхати', "<br/>", "<br/>");
            break;
        case 5:
            document.write('Завдання 5. День 5 ПТ: Хто рано встає, той до обіду вже замахався. На роботі не можна спати, пий каву', "<br/>", "<br/>");
            break;
        case 6:
            document.write('Завдання 5. День 6 СБ: Урааа, субота, вихідний... після інгліша :(', "<br/>", "<br/>");
            break;
        case 7:
            document.write('Завдання 5. День 7 НД: ... Скоріше б завтра!', "<br/>", "<br/>");
            break;
        default :
            document.write('8 днів в тижні це прикольно :)... Дві неділі в тиждень', "<br/>", "<br/>");
    }
} else {
    document.write('Завдання 5. Ви ввели не число!', "<br/>", "<br/>");
}

// 6. Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

let year = +prompt('Завдання 6. Введіть рік:', '2021');
if (((year % 4 === 0) && (year % 100 !== 0)) || ((year % 100 === 0) && (year % 400 === 0))) {
    document.write(`Завдання 6.  ${year} рік високосний`, "<br/>", "<br/>");
}else{
    document.write(`Завдання 6.  ${year} рік не високосний`, "<br/>", "<br/>");
}

// 7. Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

let name  = prompt('Яка «офіційна» назва JavaScript?:', 'ECMAScript');
if (name === 'ECMAScript' ){
    document.write('Завдання 7. «Правильно!»', "<br/>", "<br/>");
}else{
    document.write('Завдання 7. «Не знаєте? ECMAScript!', "<br/>", "<br/>");
}
