// 1. Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

let num_x = +prompt('Завдання 1. Введіть х: ', '0');
let num_y = +prompt('Завдання 1. Введіть у: ', '0');

if (num_x === num_y) {
    document.write(`Завдання 1. Введенні х і у рівні`, "<br/>", "<br/>");
}else if( num_x>num_y){
    document.write(`Завдання 1. х(${num_x}) більше від y(${num_y})`, "<br/>", "<br/>");
}else{
    document.write(`Завдання 1. y(${num_y}) більше від x(${num_x})`, "<br/>", "<br/>");
}

// 2. У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

let flat = +prompt('Завдання 2. Введіть номер квартири: ', '1');
if (flat<=0 || flat>90){
        document.write(`Завдання 2. Ви ввели не правильний номер квартири. Введіть від 1 до 90 включно.`, "<br/>", "<br/>");
} else if (flat>0 && flat<=20){
    document.write(`Завдання 2. Квартира ""${flat}"" знаходиться у під'їзді №1.`, "<br/>", "<br/>");
} else if (flat>20 && flat<=48) {
    document.write(`Завдання 2. Квартира ""${flat}"" знаходиться у під'їзді №2.`, "<br/>", "<br/>");
} else if (flat>49 && flat<=90) {
    document.write(`Завдання 2. Квартира ""${flat}"" знаходиться у під'їзді №3.`, "<br/>", "<br/>");
}else {
    document.write('Завдання 2. Ви ввели не число!', "<br/>", "<br/>");
}

// 3. Ми маємо змінну number в яку користувач задає числове значення,
// якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

let number = +prompt('Завдання 3. Введіть змінну number: ', '10');
if (number === 10){
        document.write(`Завдання 3. ВІРНО! `, "<br/>", "<br/>");
}else{
    document.write(`Завдання 3. НЕВІРНО! `, "<br/>", "<br/>");
}

// 4. Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

let arr = [46, "str", true, {day: 'one'}, [1,2,'qwerty']];
for (const x of arr) {
    if (typeof x === "number"){
        document.write(`Завдання 4. -1-. Це тип ${typeof x}.`, "<br/>", "<br/>")
    }else if (typeof x === "string"){
        document.write(`Завдання 4. -2-. Це тип ${typeof x}.`, "<br/>", "<br/>")
    }else if (typeof x === "boolean"){
        document.write(`Завдання 4. -3-. Це тип ${typeof x}.`, "<br/>", "<br/>")
    }else if (typeof x === "object" || arr[x] === "array"){
        document.write(`Завдання 4. -4-. Це тип ${typeof x}.`, "<br/>", "<br/>")
    }else{
        document.write(`Завдання 4. Невідомий тип ! )) `, "<br/>", "<br/>")
    }
}

// 5. Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

let temp = +prompt('Завдання 5. Введіть температуру повітря на вулиці: ', '8');
if (temp<10 || temp>22) {
    document.write(`Завдання 5. Не сприятлива погодні умови - сидимо вдома і вчимося ОНЛАЙН.`, "<br/>", "<br/>");
} else if(temp>=10 && temp<=22){
    document.write(`Завдання 2. Погодні умови сприятливі - йдемо ВЧИТИСЯ.`, "<br/>", "<br/>");
}else {
    document.write('Завдання 2. Ви ввели не число!', "<br/>", "<br/>");
}

// 6. За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення
//     - що число не вірне ... .
let key = +prompt('Завдання 6. Введіть число від 1 до 5 включно:', '1');
if (key < 1 || key > 5) {
    document.write('Завдання 6. Ви ввели не вірне число...', "<br/>", "<br/>");
}else if(key>0 && key<=5){
    switch (key) {
        case 1:
            document.write('Завдання 6. Вітаємо! Ви виграли телефон.', "<br/>", "<br/>");
            break;
        case 2:
            document.write('Завдання 6. Вітаємо! Ви виграли ноутбук.', "<br/>", "<br/>");
            break;
        case 3:
            document.write('Завдання 6. Вітаємо! Ви виграли холодильник.', "<br/>", "<br/>");
            break;
        case 4:
            document.write('Завдання 6. Вітаємо! Ви виграли телевізор.', "<br/>", "<br/>");
            break;
        case 5:
            document.write('Завдання 6. Вітаємо! Ви виграли автомобіль.', "<br/>", "<br/>");
            break;
        default :
            document.write('Щоб отримати подарунок оплатіть спочатку 20% вартості товару :)', "<br/>", "<br/>");
    }
} else {
    document.write('Завдання 6. Ви ввели не число!', "<br/>", "<br/>");
}
