// Всі функції повинні бути описані стрілочним типом!!!!
// 1. створити функцію яка обчислює та повертає площу прямокутника висотою
// 2. створити функцію яка обчислює та повертає площу кола
// 3. створити функцію яка обчислює та повертає площу циліндру
// 4. створити функцію яка приймає масив та виводить кожен його елемент
// 5. створити функцію яка  створює параграф з текстом. Текст задати через аргумент
// 6. створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// 7. створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий.
//     Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// 8. створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// 9. створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.

// 1. створити функцію яка обчислює та повертає площу прямокутника висотою
document.write('Завдання 1. створити функцію яка обчислює та повертає площу прямокутника висотою', '<br/>');
let rectangle = (a, b) => a * b;
console.log(`Завдання 1:  площа прямокутника - ${rectangle(5,50 )}`);
document.write(`Завдання 1: площа прямокутника - ${rectangle(5,50 )}`, '<br/>');
console.log('*****************');
document.write('******************', '<br/>');

// 2. створити функцію яка обчислює та повертає площу кола
document.write('Завдання 2. створити функцію яка обчислює та повертає площу кола', '<br/>');
let circle = (PI, r) => PI * r**2;
console.log(`Завдання 2: площа кола - ${circle(3.14,5 )}`);
document.write(`Завдання 2: площа кола - ${circle(3.14,5 )}`, '<br/>');
console.log('*****************');
document.write('******************', '<br/>');

// 3. створити функцію яка обчислює та повертає площу циліндру
document.write('Завдання 3. створити функцію яка обчислює та повертає площу циліндру', '<br/>');
let cylinder = (PI, r, h) => 2 * PI * r*(h + r);
console.log(`Завдання 3: площа циліндрa - ${cylinder(3.14,5 ,15)}`);
document.write(`Завдання 3: площа циліндрa - ${cylinder(3.14, 5, 15)}`, '<br/>');
console.log('*****************');
document.write('******************', '<br/>');

// 4. створити функцію яка приймає масив та виводить кожен його елемент
document.write('Завдання 4. створити функцію яка приймає масив та виводить кожен його елемент', '<br/>');
let printArr = (arr) => {
    for (const arrElement of arr) {
        console.log(`Завдання 4. ${arrElement}`);
        document.write(`Завдання 4. ${arrElement}`, '<br/>');
    }
};
let arr = [54, 897, 'asd', true, 'false']
printArr(arr);

// 5. створити функцію яка  створює параграф з текстом. Текст задати через аргумент
document.write('Завдання 5. створити функцію яка  створює параграф з текстом. Текст задати через аргумент', '<br/>');
let paragraph = (text) =>  `<p> ${text}</p>`;
console.log(`Завдання 5: ${paragraph('lorem2')}`);
document.write(`Завдання 5:  ${paragraph('lorem2')}`, '<br/>');
console.log('*****************');
document.write('******************', '<br/>');

// 6. створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
document.write('Завдання 6. створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий','<br/>');
let ulLi = (text) =>  {
    document.write(`<ul>`);
            document.write(`<li>${text}</li>`);
            document.write(`<li>${text}</li>`);
            document.write(`<li>${text}</li>`);
    document.write(`</ul>`);
}
let liText = 'Lorem ipsum.';
ulLi(liText);
console.log('*****************');
document.write('******************', '<br/>');

// 7. створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий.
//     Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
document.write('Завдання 7. створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий.' +
    'Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)','<br/>');
let forUlLi = (n) => {
    document.write(`<ul>`);
        for (let i = 0; i < n; i++) document.write(`<li>Text</li>`);
    document.write(`</ul>`);
}
forUlLi(3);
console.log('*****************');
document.write('******************', '<br/>');
// 8. створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
document.write('Завдання 8. створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список','<br/>');
let masForUlLi = (n) => {
    document.write(`<ol>`);
    for (let i = 0; i < n.length; i++) document.write(`<li>${n[i]}</li>`);
    document.write(`</ol>`);
}
liText = ['Lorem', 2, '13', true, 'false', 56984315];
masForUlLi(liText);
console.log('*****************');
document.write('******************', '<br/>');
// 9. створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
document.write('Завдання 9. створити функцію яка приймає масив об\'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об\'єкту окремий блок.','<br/>');
let users = [
        {name: 'vasya', age: 31, status: false},
        {name: 'petya', age: 30, status: true},
        {name: 'kolya', age: 29, status: true},
        {name: 'olya', age: 28, status: false},
        {name: 'max', age: 30, status: true},
        {name: 'anya', age: 31, status: false},
        {name: 'oleg', age: 28, status: false},
        {name: 'andrey', age: 29, status: true},
        {name: 'masha', age: 30, status: true},
        {name: 'olya', age: 31, status: false},
        {name: 'max', age: 31, status: true}
    ];
let filter = users.filter(function (user) {
    document.write((`<div>${Object.keys(user)[0]}: ${user.name}, ${Object.keys(user)[1]}: ${user.age}, ${Object.keys(user)[2]}: ${user.status};</div>`));
});
console.log('*****************');
document.write('******************', '<br/>');