// 1. Дано натуральное число n. Выведите все числа от 1 до n.
// 2. Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.
//
//
// 3. функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]
//
// 4. Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]

// 1. Дано натуральное число n. Выведите все числа от 1 до n.
document.write('Завдання 1. Дано натуральное число n. Выведите все числа от 1 до n.', '<br/>');

let numberRange = (n) =>{
    for (let i = 1; i < n; i++) {
        document.write(`Завдання 1. ${i}`, '<br/>');
        console.log(`Завдання 1. ${i}`);
    }
}
numberRange(8);
document.write('******************', '<br/>' );
console.log('*********************');


// 2. Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.
document.write('Завдання 2. Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.', '<br/>');

let numberRangeAB = (a, b) => {
    if (a === b) {
        return a;
    } else if (a < b) {
        for (; a < b; a++) {
            document.write(`Завдання 2. ${a}`, '<br/>');
            console.log(`Завдання 2. ${a}`);
        }
    } else {
        for (; a >= b; a--) {
            document.write(`Завдання 2. ${a}`, '<br/>');
            console.log(`Завдання 2. ${a}`);
        }
    }
}
numberRangeAB(8, 18);
document.write('******************', '<br/>' );
console.log('*********************');

// 3. функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]
document.write('Завдання 3. функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"', '<br/>');
let changeItemInArr = (arr, i) =>{
    let t = arr[i];
    arr[i] = arr[i+1];
    arr[i+1] = t;
    document.write(`Завдання 3. ${arr}`, '<br/>');
    console.log(`Завдання 3. ${arr}`);
}

changeItemInArr([9,8,0,4], 0);
changeItemInArr([9,8,0,4], 1);
changeItemInArr([9,8,0,4], 2);
document.write('******************', '<br/>' );
console.log('*********************');

// 4. Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]

document.write('Завдання 4. Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. ' +
    'Зберігаючи при цьому порядок не нульових значень.Двожина масиву від 2 до 100', '<br/>');
let moveZeroItemToEndArr = (arr) => {
    for (let i = 0; i <arr.length ; i++) {
        for (let j = 0; j < arr.length-1; j++) {
            if (arr[j] === 0){
                let t = arr[j]; arr[j] = arr[j+1]; arr[j+1] = t;
            }
        }
    }
    document.write(`Завдання 4. ${arr}`, '<br/>');
    console.log(`Завдання 4. ${arr}`);
}
moveZeroItemToEndArr([1,0,6,0,3]);
moveZeroItemToEndArr([0,1,2,3,4]);
moveZeroItemToEndArr([0,0,1,0]);
document.write('******************', '<br/>' );
console.log('******************' +
    '***');
