// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// 1. перебрати його циклом while
// 2. перебрати його циклом for
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
let i = 0;
console.log('Завдання 1. Перебрати масив циклом while');
while (i < arr.length){
    console.log(arr[i]);
    i++
}console.log('***************');
// *****************************************
console.log('Завдання 2. перебрати його циклом for');
for (let i of arr) {
    console.log(i);
}console.log('***************')
// *****************************************
console.log('Завдання 3. перебрати циклом while та вивести  числа тільки з непарним індексом');
i = 0;
while (i < arr.length){
    if (i % 2 !== 0) {
    console.log(`index-${i}: ${arr[i]}`);
    }
    i++
}console.log('***************');
// *****************************************
console.log('Завдання 4. перебрати циклом for та вивести  числа тільки з непарним індексом');
for (i = 0; i < arr.length; i++) {
    if (i%2 !==0){
        console.log(`index-${i}: ${arr[i]}`);
    }
}console.log('***************');
// *****************************************
console.log('Завдання 5. перебрати циклом while та вивести  числа тільки парні  значення');
i = 0;
while (i < arr.length){
    if (arr[i] % 2 === 0) {
        console.log(`index-${i}: ${arr[i]}`);
    }
    i++
}console.log('***************');
// *****************************************
console.log('Завдання 6. перебрати циклом for та вивести  числа тільки парні  значення');
for (i = 0; i < arr.length; i++) {
    if (arr[i] % 2 === 0) {
        console.log(`index-${i}: ${arr[i]}`);
    }
}console.log('***************');
// *****************************************
console.log('Завдання 7. замінити кожне число кратне 3 на слово "okten"');
for (i = 0; i < arr.length; i++) {
    if (arr[i] % 3 === 0) {
        arr[i] = 'okten'
    }
}
console.log(`${arr}`);
console.log('***************');
// *****************************************
console.log('Завдання 8. вивести масив в зворотньому порядку.');
arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18]
for (let j = arr.length - 1; j >= 0; j--) {
    console.log(arr[j])
}
console.log(`${arr.reverse()}`);
console.log('***************');
// *****************************************

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

let k = arr.length-1;
console.log('Завдання 9-1. Перебрати масив циклом while');
while (k >= 0){
    console.log(arr[k]);
    k--
}console.log('***************');
// *****************************************
k = arr.length-1;
console.log('Завдання 9-2. перебрати його циклом for');
for (;k >= 0; k--) {
    console.log(arr[k]);
}console.log('***************')
// *****************************************
console.log('Завдання 9-3. перебрати циклом while та вивести  числа тільки з непарним індексом');
k = arr.length-1;
while (k >= 0){
    if (k % 2 !== 0) {
        console.log(`index-${k}: ${arr[k]}`);
    }
    k--
}console.log('***************');
// *****************************************
console.log('Завдання 9-4. перебрати циклом for та вивести  числа тільки з непарним індексом');
k = arr.length-1;
for (;k >= 0; k--) {
    if (k%2 !==0){
        console.log(`index-${k}: ${arr[k]}`);
    }
}console.log('***************');
// *****************************************
arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18]
console.log('Завдання 9-5. перебрати циклом while та вивести  числа тільки парні  значення');
k = arr.length-1;
while (k >= 0){
    if (arr[k] % 2 === 0) {
        console.log(`index-${k}: ${arr[k]}`);
    }
    k--
}console.log('***************');
// *****************************************
arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18]
console.log('Завдання 9-6. перебрати циклом for та вивести  числа тільки парні  значення');
k = arr.length-1;
for (;k >= 0; k--) {
    if (arr[k] % 2 === 0) {
        console.log(`index-${k}: ${arr[k]}`);
    }
}console.log('***************');
// *****************************************
arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18]
console.log('Завдання 7. замінити кожне число кратне 3 на слово "okten"');
k = arr.length-1;
for (;k >= 0; k--) {
    if (arr[k] % 3 === 0) {
        arr[k] = 'okten'
    }
}
console.log(`${arr}`);
console.log('***************');
// *****************************************
