// 1. створити масив з:
//     - з 5 числових значень
//     - з 5 стічкових значень
//     - з 5 значень стрічкового, числового та булевого типу
//     - та вивести його в консоль

let arr_num = [34, 453, 1, 0, -1111];
let arr_str = ['abc', '33', 'ABC', 'OKTEN'];
let arr_list = [456, '456', true, 'true', false];
console.log(`Завдання 1. ${arr_num}`)
console.log('************************');
console.log(`Завдання 1. ${arr_str}`);
console.log('************************');
console.log(`Завдання 1. ${arr_list}`);
console.log('************************');

// ******************************************************************
// 2. Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
let empty_arr =[]
empty_arr[0] = 'one';
empty_arr[1] = '2';
empty_arr[2] = 3;
empty_arr[3] = false;
empty_arr[4] = 'true';
empty_arr[5] = [true];
console.log(`Завдання 2. ${empty_arr}`);
document.write(`Завдання 2. <br> ${empty_arr}`,"<br>","<br>");
document.write("*******************************", "<br>");


// ******************************************************************

// 3.
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
let item = [34, 453, 1, 0, -1111, 'abc', '33', 'ABC', 'OKTEN', 'true', 517, '456', true, 'true', false, [0, 5, -5], 0,5,-5, {id: 1, name: "Вася"}];
document.write('Завдання 3.', "<br>");
document.write(`За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині:`);
for (let i = 0; i < 10; i++) {
    document.write(`<div>Завдання 3. Блок - ${i + 1}. "" ${item[i]} ""</div>`)
}
document.write("*******************************");
document.write("<br>");

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
document.write(`За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині:`);
for (let j = 0; j < 10; j++) {
    document.write(`<div>Завдання 3. Index - ${j}. "" ${item[j]} ""</div>`);
}
document.write("*******************************");
document.write("<br>");

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
document.write(`За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині:`);
let k = 0
while (k < item.length){
    document.write(`<h1>Завдання 3. Блок - ${k+1}. "" ${item[k]} ""</h1>`);
    k++;
}
document.write("*******************************");
document.write("<br>");

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
document.write(`За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині:`);
k = 0
while (k < item.length){
    document.write(`<h1>Завдання 3. Index - ${k}. "" ${item[k]} ""</h1>`);
    k++;
}document.write("*******************************","<br>","<br>");

// ******************************************************

// 4. - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
//     - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
//     - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
//     - Створити масив з 10 елементів числового, стірчкового і булевого типу.
//         За допомогою if та typeof вивести тільки булеві елементи
//     - Створити масив з 10 елементів числового, стірчкового і булевого типу.
//         За допомогою if та typeof вивести тільки числові елементи
//     - Створити масив з 10 елементів числового, стрічкового і булевого типу.
//     За допомогою if та typeof вивести тільки рядкові елементи

let num_item = [34, 453, 1, 0, -1111, 517, 456,  5, -5, 999];
let str_item = ['qwerty', 'Dart', 'Вася', 'Бруклін', 'фолс', 'false', 'Lviv', 'sunday', '45', 'password'];
let diff_item = ['Dart', 15, true, 'Вася', [55, 'false'], 'Бруклін', 'фолс', false, 99, 'true'];

// Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
for (let i = 0; i < num_item.length; i++) {
    console.log(num_item[i]);
} console.log('************************');
//- Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
for (let i = 0; i < str_item.length; i++) {
    console.log(str_item[i]);
} console.log('************************');
//- Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
for (let i = 0; i < diff_item.length; i++) {
    console.log(diff_item[i]);
} console.log('************************');
//- Створити масив з 10 елементів числового, стірчкового і булевого типу.За допомогою if та typeof вивести тільки булеві елементи
for (let i = 0; i < diff_item.length; i++) {
    if (typeof diff_item[i] === "boolean"){
        console.log(diff_item[i]);
    }
} console.log('************************');
// - Створити масив з 10 елементів числового, стірчкового і булевого типу.За допомогою if та typeof вивести тільки числові елементи
for (let i = 0; i < diff_item.length; i++) {
    if (typeof diff_item[i] === "number"){
        console.log(diff_item[i]);
    }
} console.log('************************');
//- Створити масив з 10 елементів числового, стрічкового і булевого типу.За допомогою if та typeof вивести тільки рядкові елементи
for (let i = 0; i < diff_item.length; i++) {
    if (typeof diff_item[i] === "string"){
        console.log(diff_item[i]);
    }
} console.log('************************');

//
// 5.  Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів.
//         Вивести в консоль всі його елементи в циклі.
//     - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
//     - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
//     - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
//     - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
//     - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write

let empty_mas =[];
empty_mas[0] = 'one';
empty_mas[1] = '2';
empty_mas[2] = 3;
empty_mas[3] = false;
empty_mas[4] = 'true';
empty_mas[5] = ['qwerty'];
empty_mas[6] = [NaN];
empty_mas[7] = [null];
empty_mas[8] = ['None'];
empty_mas[9] = [845];

// Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів.
// Вивести в консоль всі його елементи в циклі
let i = 0
for (; i< empty_mas.length; i++){
    console.log(empty_mas[i]);
}
console.log('************************');

document.write(`Завдання 5-2. - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write`,"<br>")
i = 1
for (; i<= 10; i++){
    console.log(i);
    document.write(i,"<br>");
}
console.log('************************');

document.write(`Завдання 5-3. - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write`,"<br>")
i = 1
for (; i<= 100; i++){
    console.log(i);
    document.write(i,"<br>");
}
console.log('************************');

document.write(`Завдання 5-4. - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write`,"<br>")
i = 1
for (; i<= 100; i+=2){
    console.log(i);
    document.write(i,"<br>");
}
console.log('************************');

document.write(`Завдання 5-5. - - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write`,"<br>")
i = 1
for (; i<= 100; i++){
    if (i % 2 === 0) {
        console.log(i);
        document.write(i, "<br>");
    }
}
console.log('************************');

document.write(`Завдання 5-6. - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write`,"<br>")
i = 1
for (; i<= 100; i++){
    if (i % 2 !== 0) {
        console.log(i);
        document.write(i, "<br>");
    }
}
