// 1. Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив,
// в якому  3 і більше елементи. Інакше слід вивести на екран повідомлення про те, що це маленький масив,
// в якому менше 3-х елементів.

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if (friends.length >= 3) {
    document.write(`Завдвння 1. Це великий масив, в якому 3 і більше елементи`, "<br/>", "<br/>")
}
else {
    document.write(`Завдвння 1. Це маленький масив, в якому менше 3-х елементів`, "<br/>", "<br/>")
}

// 2. Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше).
//     Перевірити, чи знаходиться перше число між двома іншими.

let arr = [5556, 6559, 2256];
document.write(`Завдання 2. Число що посередені: ${arr[1]}`, "<br/>", "<br/>");
for (let i in arr){
    if ((arr[i] !== Math.max(...arr)) && (arr[i] !== Math.min(...arr))) {
        document.write(`Завдання 2. Середнє число(більше одного, але менше за інше): ${arr[i]}`, "<br/>", "<br/>");
    }
}
if ((arr[1]>= arr[0] && arr[1]<= arr[2]) || (arr[1]>= arr[2] && arr[1]<= arr[0]) ){
        document.write(`Завдання 2. Число  ${arr[1]} знаходиться між двома іншими числами  ${arr[0]} і  ${arr[2]}`, "<br/>", "<br/>");
}else {
        document.write(`Завдання 2. Число  ${arr[1]} не знаходиться між двома іншими числами  ${arr[0]} і  ${arr[2]}`, "<br/>", "<br/>");

}

// 3. Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

let a = +prompt('Завдання 3. Введіть число а: ' , '1');
let b = +prompt('Завдання 3. Введіть число b: ' , '1');
let result = (a + b < 4) ? 'Мало ' : 'Багато ';
document.write(`Завдання 3. ${result}`, "<br/>", "<br/>")

// 4. Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

let num = +prompt('Завдання 4. Введіть число від -100 до +100: ' , '1');

let message = (num === 0) ? 'Ваше число "0"' :
    (num < 0) && (num > -100) ? `Ваше число ${num}  негативне` :
        (num > 0) && (num <=100) ? `Ваше число ${num} позитивне` :
            `${num} -Неправильне число`;

document.write(`Завдання 4. ${message}`, "<br/>", "<br/>")